ednieuw/RTCcheck/ESP32_RTCcheckV023/ESP32_RTCcheckV023.ino
}

//--------------------------------------------                                                //
// LOGBUFFER Printlast 500 lines      
//--------------------------------------------
void HandleTekstPrint(AsyncWebServerRequest *request)
{
 if (!LogBuffer){ request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 ssize_t lastNewline = -1;                                                                     // Find the actual end of the last complete line (last \n before LogWritePos)
 ssize_t searchPos = (LogWritePos == 0) ? LogBufferSize - 1 : LogWritePos - 1;
  for (size_t i = 0; i < LogBufferSize; i++)
    {
     if (LogBuffer[searchPos] == '\n') 
        {
         lastNewline = searchPos;
         break;
        }
     if (!LogWrapped && searchPos == 0) break;
     searchPos = (searchPos == 0) ? LogBufferSize - 1 : searchPos - 1;
    }
 
 if (lastNewline == -1)                                                                        // No complete lines yet
    {
     request->send(200, "text/plain", "No complete lines in buffer\n");
     return;
    }
 
 size_t lineCount = 0;                                                                        // Now count back 100 for testing) (500) lines from lastNewline
 ssize_t pos = lastNewline;
 
 for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 499; scanned++)              //  499 because we already found one \n
    {
     pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
     if (LogBuffer[pos] == '\n') lineCount++;
     if (!LogWrapped && pos == 0) break;
    }
 size_t start = (pos + 1) % LogBufferSize;                                                    // Start is the position right after the newline we stopped at
 size_t end = (lastNewline + 1) % LogBufferSize;                                              // Include the last newline
 
 if (!LogWrapped || start <= end)
   {
    response->write(LogBuffer + start, end - start);
   }
 else
   {
    response->write(LogBuffer + start, LogBufferSize - start);
    response->write(LogBuffer, end);
   }
 request->send(response);
}


//--------------------------------------------                                                //
// LOGBUFFER Stream all the circular log buffer directly to the client
//--------------------------------------------
void HandleTekstDownload(AsyncWebServerRequest *request)
{
 if (!LogBuffer) {request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 if (!LogWrapped) response->write(LogBuffer, LogWritePos);                                    // Buffer hasn't wrapped yet - just write from start to current position
 else                                                                                         // Buffer has wrapped - find the oldest complete line
   {
    ssize_t pos = LogWritePos;                                                                // Start from LogWritePos and scan forward to find first complete line
    while (pos < (ssize_t)LogBufferSize && LogBuffer[pos] != '\n')   pos++;                   // Scan forward to find the first '\n' (end of partial line)
    if (pos < (ssize_t)LogBufferSize) pos++;                                                  // Move past the '\n' to start of next complete line
    if (pos >= (ssize_t)LogBufferSize) pos = 0;                                               // If we've gone past the end, wrap to beginning
    size_t start = pos;
    if (start < LogWritePos) response->write(LogBuffer + start, LogWritePos - start);         // Data doesn't wrap                                                      // Now stream from start position (oldest complete line)
    else                                                                                      // Data wraps around - write in two parts
      {
       size_t tail = LogBufferSize - start;
       response->write(LogBuffer + start, tail);                                              // First part: start → end of buffer
       response->write(LogBuffer, LogWritePos);                                               // Second part: 0 → write position
      }
   }
 request->send(response);
}

/// End ringbuffer


/// --------------------------------- RTC8 

//--------------------------------------------                                                //
// RTC8 
//-------------------------------------------- 
RTC_DS3231 rtc[MAX_RTC];                                                                      // RTC objecten aanmaken
bool rtcActive[MAX_RTC] = {false};                                                            // Array om bij te houden welke RTC's werkend zijn
int activeRTCCount     = 0;

//--------------------------------------------                                                //
// RTC8 Initialyse all connected RTC's
//--------------------------------------------
void SetupRTCs(void) 
{
  Serial.println("DS3231 RTC Multiplexer Test");
  Serial.println("===========================");
  sprintf(sptext, "Software: %s", SoftwareName());  Tekstprintln(sptext);   
  
  Serial.print("TCA9548A search on addres 0x");                                               // Test or TCA9548A is available
  Serial.print(TCA_ADDR, HEX);
  Serial.print("... ");
  
  Wire.beginTransmission(TCA_ADDR);
  if (Wire.endTransmission() == 0) {
    Serial.println("FOUND!");
  } else 
  {
    Serial.println("NOT FOUND!\ncheck wiring and power");
    while(1);                                                                                // 
  }  
  Serial.println("\nScanning DS3231 modules...");                                            // Scan which channels a DS3231 has
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);
    delay(50); 
    Wire.beginTransmission(0x68);                                                            // DS3231 address
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {Serial.print("DS3231 found on channel "); Serial.println(i);  } 
    else {sprintf(sptext,"No DS3231 on channel %d Error : %d", i,error); Tekstprintln(sptext); }
  }
  Serial.println("\nInitialising RTC modules...");                                            // Initialiseonly found RTC modules
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);                                                                      // Select multiplexer channel
    delay(50);
    
    Serial.print("Initialising RTC ");
    Serial.print(i);
    Serial.print("... ");
    
    // Test eerst of er een device is
    Wire.beginTransmission(0x68);
    if (Wire.endTransmission() != 0) 
    {
      Serial.println("NO DEVICE");
      continue;
    }
    
    if (!rtc[i].begin()) 
     {
      Serial.println("FAILED!");
      Serial.println("Check connection on channel " + String(i));
      rtcActive[i] = false;
     } 
    else 
     {
      Serial.println("OK!");
      rtcActive[i] = true;
      activeRTCCount++;
      DateTime newTime = rtc[i].now();                                                        // Check time set
      sprintf(sptext,"RTC%d current time: %02d/%02d/%04d %02d:%02d:%02d ",i, newTime.day(),newTime.month(),newTime.year(),
                                                                      newTime.hour(),newTime.minute(),newTime.second());
      Tekstprintln(sptext);  
     }
    delay(100); 
   }
  sprintf(sptext,"Setup finished! %d  RTC modules active.", activeRTCCount);
  Tekstprintln(sptext); 
}

//--------------------------------------------                                                //
// RTC8 Print RTC times
//-------------------------------------------- 
void PrintRTCtimes(void)
{
 for (int i = 0; i < MAX_RTC; i++)                                                           // Read time of all ACTIVE RTC modules
  {
   if (!rtcActive[i]) continue;                                                              // Skip non-active RTC's
   selectTCAChannel(i);                                                                      // Select the RTC channel on the TCA9548A I2C multiplexer
   delay(10);
   DateTime rtcNow = rtc[i].now();
   Tekstprintlnf("RTC %d: %02d/%02d/%04d %02d:%02d:%02d T: %5.2f C",
       i, rtcNow.day(), rtcNow.month(), rtcNow.year(), rtcNow.hour(), rtcNow.minute(), rtcNow.second(), 
       rtc[i].getTemperature());  
  }
}
//--------------------------------------------                                                //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 Tekstprint("");
 CalcDifRTCtimes();
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   Tekstprintf("|T%d:%2ld",i,RTCdiffSec[i]);
  }
 Tekstprintf("|C: %5.2f", GetMedianRTCTemperature());
}
//--------------------------------------------                                                //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max time difference = 25 seconds. 26 = NA
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 CalcDifRTCtimes();                                                                          // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                                           // Read time of all ACTIVE RTC modules
  {
   int c;
   if (!rtcActive[i]) c = -1;                                                                // Skip non-active RTC's 
   else c = RTCdiffSec[i]; 
   switch (c)
    {
      case  0 ...  1: ColorLed(i,green);      break;
      case  5 ...  7: ColorLed(i,greenblue);  break;
      case  2 ...  4: ColorLed(i,pink);       break;
      case  8 ... 10: ColorLed(i,darkviolet); break;
      case 11 ... 17: ColorLed(i,purple);     break;
      case 18 ... 25: ColorLed(i,orange);     break;
      case 26 ...999: ColorLed(i,red);        break;
      default:        ColorLed(i,blue); 
    }
  }
SetTempColor(9, GetMedianRTCTemperature());                                                     //Last LED number 10 = led 9
ShowLeds(); 
}

//--------------------------------------------                                                //
// RTC8 Calculate difference in sec from NTP
//-------------------------------------------- 
static time_t To_time_t(const DateTime& dt)
{
 struct tm rtc_tm = {};
 rtc_tm.tm_year  = dt.year()  - 1900;
 rtc_tm.tm_mon   = dt.month() - 1;
 rtc_tm.tm_mday  = dt.day();
 rtc_tm.tm_hour  = dt.hour();
 rtc_tm.tm_min   = dt.minute();
 rtc_tm.tm_sec   = dt.second();
 rtc_tm.tm_isdst = -1;
 return mktime(&rtc_tm);
}

