ednieuw/RTCcheck/ESP32_RTCcheckV023/ESP32_RTCcheckV023.ino
//--------------------------------------------
// RTC8 Calculate difference in sec from NTP
//--------------------------------------------
void CalcDifRTCtimes(void)
{
 struct tm ntp_tm = timeinfo;
 ntp_tm.tm_isdst = -1;
 const time_t tNTP = mktime(&ntp_tm);
 for (int i = 0; i < MAX_RTC; i++)
   {
    if (!rtcActive[i]) { RTCdiffSec[i] = -1; continue; }
    selectTCAChannel(i);
    delay(10);
    RTCdiffSec[i] = abs(tNTP - To_time_t(rtc[i].now()));
   }
}

//--------------------------------------------                                                //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                                                    // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                                                   // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  if (error != 0)  Tekstprintf("Error selecting channel %d Error code : %d", channel,error);
  delay(10);                                                                                  // short delay after channel change
}
//--------------------------------------------                                                //
// RTC8 set Time For RTC 
//--------------------------------------------
void SetTimeForRTC(int rtcIndex, DateTime newTime) 
{
 if (!rtcActive[rtcIndex]) return;
 selectTCAChannel(rtcIndex);
 rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                                                //
// RTC8 set current NTP Time For RTC Number X 
//--------------------------------------------
void SetNTPTimeForRTC(int rtcIndex) 
{
 if (!rtcActive[rtcIndex]) return;
 DateTime referenceTime = GetLocalDateTime() + 1;                                            // Get the current time and add 1 sec setting time 
 selectTCAChannel(rtcIndex);
 delay(50);
 DateTime before = rtc[rtcIndex].now();                                                           // Show time before update
 Tekstprintf("RTC %d: before sync %s", rtcIndex, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 rtc[rtcIndex].adjust(referenceTime);                                                             // Update time
 delay(50); 
 DateTime after = rtc[rtcIndex].now();                                                            // Verify
 Tekstprintf("RTC %d:  after sync %s", rtcIndex, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 Tekstprintln("Synchronisation done!\n");
}

//--------------------------------------------                                                //
// RTC8 Print Time For RTC 
//--------------------------------------------
void PrintTimeForRTC(int rtcIndex) 
{
 if (!rtcActive[rtcIndex]) return;
 selectTCAChannel(rtcIndex);
 DateTime now = rtc[rtcIndex].now();
 Tekstprintf("RTC %d: %s", rtcIndex, now.timestamp(DateTime::TIMESTAMP_FULL).c_str());  
}
//--------------------------------------------                                                //
// RTC8 get Temperature For RTC
//--------------------------------------------
float GetTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
// Wait for the second tick per RTC to update that RTC 
//--------------------------------------------
void SynchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) { if (rtcActive[i]) { referenceRTC = i;   break;  }  }
  if (referenceRTC == -1)           { Tekstprintln("No active RTC's found!"); return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = GetLocalDateTime() + 1;                                            // Get the current time and add 1 sec setting time  
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");
  Tekstprintlnf("Reference time of NTP RTC %d: %s", referenceRTC, referenceTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     time_t t = time(nullptr);                         // Wait for the next clean second boundary
     while (time(nullptr) == t) { delay(1); }         // spin until second ticks over
     DateTime referenceTime = GetLocalDateTime();      // now exactly on the second, no +1 needed
        rtc[i].adjust(referenceTime);
        DateTime after = rtc[i].now();
        Tekstprintlnf("RTC %d: Synced to %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    }
  UpdateRTCTimeLEDs();  
  Tekstprintln("Synchronisation done!\n");
}


//--------------------------------------------                                                //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void SetCurrentTime() 
{
 int year, month, day, hour, minute, second;                                                 //
 hour   = timeinfo.tm_hour;
 minute = timeinfo.tm_min;
 second = timeinfo.tm_sec;
 year   = timeinfo.tm_year + 1900;                                                            // Inow.year() is years since 2000 tm_year is years since 1900
 month  = timeinfo.tm_mon  + 1;
 day    = timeinfo.tm_mday;
 DateTime newTime(year, month, day, hour, minute, second);
 Tekstprint("New time: ");
 Tekstprintln(newTime.timestamp(DateTime::TIMESTAMP_FULL).c_str());
 for (int i = 0; i < MAX_RTC; i++) 
    {
     if (!rtcActive[i]) continue;
     selectTCAChannel(i);
     delay(50);      
     DateTime before = rtc[i].now();                                                         // Show time before update
     Tekstprintlnf("RTC %d: before sync %s", i, before.timestamp(DateTime::TIMESTAMP_FULL).c_str());
     rtc[i].adjust(newTime);
     delay(50);
     DateTime after = rtc[i].now();                                                          // Verify
     Tekstprintlnf("RTC %d: after sync %s", i, after.timestamp(DateTime::TIMESTAMP_FULL).c_str());
    }
 UpdateRTCTimeLEDs();     
 Tekstprintln("All active RTC's updated!\n");
}
//--------------------------------------------                                                //
// RTC8 Set Temperature Color
//--------------------------------------------
void SetTempColor(int Lednr, float temp)
{
 temp = constrain(temp, -10.0, 50.0);
 float t = (temp + 10.0) / 60.0;                         // normalize 0.0 to 1.0
 uint8_t r, g, b;

 if (t < 0.5)                                            // blue to green (-10C to 20C)
  {
   float tt = t * 2.0;
   r = 0;
   g = (uint8_t)(255 * tt);
   b = (uint8_t)(255 * (1.0 - tt));
  }
 else                                                     // green to red  (20C to 50C)
  {
   float tt = (t - 0.5) * 2.0;
   r = (uint8_t)(255 * tt);
   g = (uint8_t)(255 * (1.0 - tt));
   b = 0;
  }
 ColorLed(Lednr, ((uint32_t)r << 16) | ((uint32_t)g << 8) | b);
}

//--------------------------------------------                                                //
// RTC8 Get media temperature of all active LEDs
//--------------------------------------------
float GetMedianRTCTemperature(void)
{
 float temps[MAX_RTC];
 int count = 0;

 for (int i = 0; i < MAX_RTC; i++)                       // collect temperatures of active RTC's
  {
   if (!rtcActive[i]) continue;
   selectTCAChannel(i);
   temps[count++] = rtc[i].getTemperature();
  }

 if (count == 0) return -273.0;                          // no active RTC's

 for (int i = 0; i < count - 1; i++)                     // bubble sort
  for (int j = 0; j < count - i - 1; j++)
   if (temps[j] > temps[j+1])
    {
     float tmp  = temps[j];
     temps[j]   = temps[j+1];
     temps[j+1] = tmp;
    }

 if (count % 2 == 0)                                     // even number: average of two middle values
      return (temps[count/2 - 1] + temps[count/2]) / 2.0;
 else return  temps[count/2];                            // odd number: middle value
}

/// --------------------------------- RTC8 



